Documents/PayrollSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>PayrollSheet</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationKindsPayrollSheet</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Employees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/PayrollPayments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>PayrollPayments</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountCur</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RegistrationPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Employees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Employees</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OccupiedRates</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WorkSchedule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorkSchedules</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/OperationKindsPayrollSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>OperationKindsPayrollSheet</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Advance</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/PayrollSheet/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;

	DocumentAmount = Employees.Total("PaymentAmount");
	
EndProcedure // BeforeWrite()

#EndRegion

#Region ProgramInterface

// Procedure fills tabular section Employees balance by charges.
//
Procedure FillByBalanceAtServer() Export
	
	If OperationKind = Enums.OperationKindsPayrollSheet.Salary Then
	
		Query = New Query;
		Query.Text = "SELECT
		               |	PayrollPaymentsBalance.Employee,
		               |	SUM(CASE
		               |			WHEN &SettlementsCurrency = &DocumentCurrency
		               |				THEN PayrollPaymentsBalance.AmountCurBalance
		               |			ELSE CAST(PayrollPaymentsBalance.AmountCurBalance * &ExchangeRate / &Multiplicity AS NUMBER(15, 2))
		               |		END) AS PaymentAmount,
		               |	SUM(PayrollPaymentsBalance.AmountCurBalance) AS SettlementsAmount
		               |FROM
		               |	AccumulationRegister.PayrollPayments.Balance(,
		               |			Company = &Company
		               |				AND RegistrationPeriod = &RegistrationPeriod
		               |				AND Currency = &SettlementsCurrency
		               |				AND StructuralUnit = &StructuralUnit) AS PayrollPaymentsBalance
		               |WHERE
		               |	PayrollPaymentsBalance.AmountCurBalance > 0
		               |
		               |GROUP BY
		               |	PayrollPaymentsBalance.Employee
		               |
		               |ORDER BY
		               |	PayrollPaymentsBalance.Employee.Description";
		
		Query.SetParameter("RegistrationPeriod", 	RegistrationPeriod);
		Query.SetParameter("Company", 		SmallBusinessServer.GetCompany(Company));
		Query.SetParameter("StructuralUnit", StructuralUnit);
		Query.SetParameter("SettlementsCurrency",		SettlementsCurrency);
		Query.SetParameter("DocumentCurrency",	DocumentCurrency);
		Query.SetParameter("ExchangeRate",				ExchangeRate);
		Query.SetParameter("Multiplicity",			Multiplicity);
		
		Employees.Load(Query.Execute().Unload());

	ElsIf OperationKind = Enums.OperationKindsPayrollSheet.Advance Then	
		
		Message = New UserMessage();
		Message.Text = NStr("en = 'In case of advance payment filling in by balances is not provided!'");
 		Message.Message();
		
	EndIf;
	
EndProcedure

// Procedure fills tabular section Employees by department.
//
Procedure FillByDivisionAtServer() Export
		
	Query = New Query;
	Query.Text = "SELECT DISTINCT
	               |	EmployeesDeparnments.Employee AS Employee,
	               |	EmployeesDeparnments.StructuralUnit AS StructuralUnit
	               |FROM
	               |	(SELECT
	               |		EmployeesSliceLast.Employee AS Employee,
	               |		EmployeesSliceLast.StructuralUnit AS StructuralUnit
	               |	FROM
	               |		InformationRegister.Employees.SliceLast(
	               |				&RegistrationPeriod,
	               |				Company = &Company
	               |					AND (StructuralUnit = &StructuralUnit
	               |						OR StructuralUnit = VALUE(Catalog.StructuralUnits.EmptyRef))) AS EmployeesSliceLast
	               |	
	               |	UNION ALL
	               |	
	               |	SELECT
	               |		Employees.Employee,
	               |		Employees.StructuralUnit
	               |	FROM
	               |		InformationRegister.Employees AS Employees
	               |	WHERE
	               |		Employees.Company = &Company
	               |		AND Employees.StructuralUnit = &StructuralUnit
	               |		AND Employees.Period between &RegistrationPeriod AND ENDOFPERIOD(&RegistrationPeriod, MONTH)) AS EmployeesDeparnments
	               |WHERE
	               |	EmployeesDeparnments.StructuralUnit <> VALUE(Catalog.StructuralUnits.EmptyRef)
	               |
	               |GROUP BY
	               |	EmployeesDeparnments.Employee,
	               |	EmployeesDeparnments.StructuralUnit
	               |
	               |ORDER BY
	               |	Employee";
	
	Query.SetParameter("RegistrationPeriod", 		RegistrationPeriod);
	Query.SetParameter("StructuralUnit",		StructuralUnit);
	Query.SetParameter("Company", 			SmallBusinessServer.GetCompany(Company));
	
	Employees.Load(Query.Execute().Unload());
	
EndProcedure

#EndRegion

#EndIf
